{"CMDE":{"s_no":"1","department_id":"CMDE","department_name":"Curriculum, Material Development and Evaluation","department_details":"To adopt existing items and develop new items for elementary education and elementary teacher education programmes. Techniques and guide lines for continuous and summative learner-evaluation. Tests, question/item banks, rating scales, observation schedules, guidelines for diagnostic testing/remedial programmes talent identification procedure etc. To help DRU in development work as above for Adult and non-formal Education. To undertake testing on sample basis to access achievement levels among leaner's , especially with reference to Min levels prescribed for the primary and upper stage and for adult learners under NLMA. To conduct workshops for the adoption/development work mentioned in (1) above , as also in-service programmes relating to CMDE.","hod_name":"Mr. Firdous Ahmad  Asime"},"PSTE":{"s_no":"2","department_id":"PSTE","department_name":"pre-service teacher education","department_details":"To serve as the nodal branch for the following : . Organizing pre-service course for elementary school teachers and to provide academic inputs into such course in the subjects represented in the branch. Propagation of learner centered education and education for personality development through training, extension, preparation of suitable teaching aids, action researches etc.All General matters concerning teaching methodology and specific matters concerning teachers methodology of the school NFE subjects represented in the branch.To provide inputs into programmes/activities of all other braches of the Institute, to the extent of subjects/areas represented/handled in the branch.Maintenance of science lab, psychology equipment, Resource Room for Education of Disabled children, Rooms for Art education and equipments and facilities for sports and physical Education.","hod_name":"MS. Yasmeen  jan"},"WE":{"s_no":"3","department_id":"WE","department_name":"work experience","department_details":"To indentify locally relevant WE areas and incorporation with concerned nodal branches, to develop sample curricular units, teaching aids and evaluation tools/techniques in such areas.To help educational authorities and elementary schools/NFE/AE centers in planned introduction of work Experience activities in such schools/centers.As backup to (2) above, to conduct appropriate in-service programmes for teachers in the areas of WE.To organize community service activity study and visits to work centers as part of training programmes and to promote such activities an extracurricular basis.To maintain workshop/farm/Garden as a part of WE activities.","hod_name":"MS.  Muneer Fatima"},"IFIC":{"s_no":"4","department_id":"IFIC","department_name":"in-service programmes, fields interacrion and innovation coordination","department_details":"To assist educational authorities in planning and coordination of in-service education programmes for elementary teachers throughout the district, and to plan and coordinate such programmes held in the DIET, the branch would.Identity training needs of elementary teachers in the district and prepare a perspective plan for meeting such needs.To prepare an annual calendar of all programmes to be held outside the DIET.Help concerned authorities in preparing an annual calendar of in-service programmes to be held outside the DIET.To maintain data base of all persons, except NFE/AE personnel, who undergo training at the institute and to organize follow-up activities of pursuant to such training through correspondence, visits, transmission of printed materials.To serve as a reference and resource centers for teachers who wish to continue their education. ","hod_name":"MS.  Rabia. Rasool"},"P & M":{"s_no":"5","department_id":"P & M","department_name":"Planning and management","department_details":"To maintain an appropriate database for the district this may be required for various planning exercises aimed at the UPE/UEE/NLM goals and for monitoring progress towards these goals.To provide technical assistance to educational authorities in : (I) school mapping (II) Micro Planning for in an area specific and target group specific manner (III) formation and activation of school complexes, school etc and (IV) Institutional evaluation.To serve as the nodal branch in relation to all programmes of community involvement in basic education, and in particular to conduct orientation programmes for members of SMC's VEC's community leaders, youth and other voluntary educatiodnalnwnuoarikers.To act as the nodal branch for preparing prospective and annual institutional plans and annual self evaluation reports for the DIET and for liaising with DEO's.","hod_name":"MS. Fatima Bano"},"ET":{"s_no":"6","department_id":"ET","department_name":"education technology","department_details":"To develop in collaboration with concerned staff of DIET and other resources persons simple ,effective, and ,low-cost teaching aids for various subjects/areas relevant to elementary education and elementary teacher education-charts, diagrams, models, photographs, slides, audio tapes, pay scripts, songs etc.To help the DRU in developing low cost teaching aids developed in house as well as elsewhere and a library of educational video/audio cassettes and if the institute has a film projector or films.To lend slides, cassettes and films to institutions having Playing/projection facilities, and to borrow them from others resource centers.To lease with nearby Radio station for arranging educati onal broadcast suitable for elementary school children, AE/NFE learners, teachers/Instructors of the district.","hod_name":"MS.  Momina Qadir"},"DRU":{"s_no":"7","department_id":"DRU","department_name":"district resource unit","department_details":"To assist educational authorities in planning and coordination of training programmes for AE/NFE personnel throughout the district and to provide necessary support to such programmes organized outside the DIET.To evaluate and monitor the quality and efficiency of training programmes of NFE/AE personnel held in and outside the DIET and to strive for their continuous improvement.To undertake filed interaction work visa-a-vis the AE/NFE projects and centers in the district and to act as the referral unit or academic problems thrown up by the field in the areas of AE/NFE.To undertake action research in all areas relevant for making NFE/AE more effective in collaboration with other branches, to the extend necessary.","hod_name":"Mr. Manzoor Ahmad Kumar"}	}